tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "beeftornado/rmtree"
tap "f/mcptools"
tap "facebook/fb"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "ggozad/formulas"
tap "jesseduffield/lazygit"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mobile-dev-inc/tap"
tap "nikitabobko/tap"
tap "withgraphite/tap"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Dependency manager for Cocoa projects
brew "cocoapods"
# TIFF library and utilities
brew "libtiff"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Manage stacked Git branches
brew "git-spice"
# Audit git repos for secrets
brew "gitleaks"
# GNU typing tutor
brew "gnu-typist"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Incremental parsing library
brew "tree-sitter"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line Git information tool
brew "onefetch"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Object-relational database system
brew "postgresql@18"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby autoformatter
brew "rubyfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Cozy typing speed tester in terminal
brew "typioca"
# Maintained ctags implementation
brew "universal-ctags"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Tools for building Android applications
cask "android-studio"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Configuration tool for the Betaflight firmware
cask "betaflight-configurator"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Music player
cask "deezer"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# AI-powered notepad for meetings
cask "granola"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Customise mouse behavior
cask "linearmouse"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# VPN client
cask "mullvad-vpn"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Native companion app for AI coding agents
cask "open-island"
# Control your tools with a few keystrokes
cask "raycast"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kaiwood.endwise"
vscode "naumovs.color-highlight"
vscode "prisma.prisma"
vscode "semanticdiff.semanticdiff"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "tamasfe.even-better-toml"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "wasp-lang.wasp"
vscode "yoavbls.pretty-ts-errors"
go "cmd/go"
go "cmd/gofmt"
cargo "gelatyx"
npm "corepack"
npm "eas-cli"
