tap "beeftornado/rmtree"
tap "felixkratz/formulae"
tap "ggozad/formulas"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "nikitabobko/tap"
tap "supabase/tap"
tap "withgraphite/tap"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Dependency manager for Cocoa projects
brew "cocoapods"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# TIFF library and utilities
brew "libtiff"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU typing tutor
brew "gnu-typist"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true
# GNU utilities for networking
brew "inetutils"
# Lazier way to manage everything docker
brew "lazydocker"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line Git information tool
brew "onefetch"
# Object-relational database system
brew "postgresql@13", restart_service: :changed, link: true
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby autoformatter
brew "rubyfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# Supabase CLI
brew "supabase/tap/supabase"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Music player
cask "deezer"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Customise mouse behavior
cask "linearmouse"
# Screen and video recording software
cask "loom"
# VPN client
cask "mullvadvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fooo.ruby-spec-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "kaiwood.endwise"
vscode "mquandalle.graphql"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tauri-apps.tauri-vscode"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
