tap "beeftornado/rmtree"
tap "ejoffe/tap"
tap "f/mcptools"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "ggozad/formulas"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mobile-dev-inc/tap"
tap "nikitabobko/tap"
tap "supabase/tap"
tap "withgraphite/tap"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Dependency manager for Cocoa projects
brew "cocoapods"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# GNU typing tutor
brew "gnu-typist"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU utilities for networking
brew "inetutils"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# TIFF library and utilities
brew "libtiff"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Incremental parsing library
brew "tree-sitter"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line Git information tool
brew "onefetch"
# AI coding agent, built for the terminal
brew "opencode"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ruby autoformatter
brew "rubyfmt"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Stacked Pull Requests on GitHub
brew "ejoffe/tap/spr"
# Command-line interface for interacting with MCP (Model Context Protocol) servers
brew "f/mcptools/mcp"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# The easiest way to automate UI testing for your mobile app
brew "mobile-dev-inc/tap/maestro"
# Supabase CLI
brew "supabase/tap/supabase"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# GraphQL client
cask "altair-graphql-client"
# Tools for building Android applications
cask "android-studio"
# App for managing battery charging. (Also installs a CLI on first use.)
cask "battery"
# Music player
cask "deezer"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Customise mouse behavior
cask "linearmouse"
# Screen and video recording software
cask "loom"
# VPN client
cask "mullvad-vpn"
# Free and open-source RSS reader
cask "netnewswire"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Get up and running with large language models locally
cask "ollama-app"
# Control your tools with a few keystrokes
cask "raycast"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "kaiwood.endwise"
vscode "naumovs.color-highlight"
vscode "prisma.prisma"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "wasp-lang.wasp"
vscode "yoavbls.pretty-ts-errors"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
