asvetliakov.vscode-neovim
bradlc.vscode-tailwindcss
chakrounanas.turbo-console-log
dbaeumer.vscode-eslint
eamodio.gitlens
enkia.tokyo-night
esbenp.prettier-vscode
fooo.ruby-spec-runner
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github
golang.go
graphite.gti-vscode
kaiwood.endwise
mquandalle.graphql
naumovs.color-highlight
orta.vscode-jest
panicbit.cargo
pkief.material-icon-theme
rust-lang.rust-analyzer
shopify.ruby-lsp
streetsidesoftware.code-spell-checker
svelte.svelte-vscode
tauri-apps.tauri-vscode
usernamehw.errorlens
yoavbls.pretty-ts-errors
